zzuzpb/virtual-sense/VirtualSense/platform/virtualsense/dev/_hal_cc2520.h
/***********************************************************************************
  Filename:     hal_cc2520.h

  Description:  This file defines the interface to the CC2520 radio.

***********************************************************************************/
#ifndef HALCC2520_H
#define HALCC2520_H

/***********************************************************************************
* INCLUDES
*/
#include "contiki.h"
#include <msp430.h>
#include <spi_UCB1.h>

//#define INCLUDE_PA

/* Some general purpose definitions */

#ifndef TRUE
#define TRUE 1
#endif

#ifndef FALSE
#define FALSE 0
#endif

#ifndef NULL
#define NULL (void *)0
#endif
/***********************************************************************************
* MACROS
*/

/*
*  This macro is for use by other macros to form a fully valid C statement.
*  Without this, the if/else conditionals could show unexpected behavior.
*
*  For example, use...
*    #define SET_REGS()  st( ioreg1 = 0; ioreg2 = 0; )
*  instead of ...
*    #define SET_REGS()  { ioreg1 = 0; ioreg2 = 0; }
*  or
*    #define  SET_REGS()    ioreg1 = 0; ioreg2 = 0;
*  The last macro would not behave as expected in the if/else construct.
*  The second to last macro will cause a compiler error in certain uses
*  of if/else construct
*
*  It is not necessary, or recommended, to use this macro where there is
*  already a valid C statement.  For example, the following is redundant...
*    #define CALL_FUNC()   st(  func();  )
*  This should simply be...
*    #define CALL_FUNC()   func()
*
* (The while condition below evaluates false without generating a
*  constant-controlling-loop type of warning on most compilers.)
*/
#define st(x)      do { x } while (__LINE__ == -1)

/* u16_t processing */
#define HI_UINT16(a) (((u16_t)(a) >> 8) & 0xFF)
#define LO_UINT16(a) ((u16_t)(a) & 0xFF)
/* u32_t processing */
#define HI_UINT32(a) ((u16_t) (((u32_t)(a)) >> 16))
#define LO_UINT32(a) ((u16_t) ((u32_t)(a)))


// MCU port control for SPI interface
#define CC2520_DISABLE_SPI_FUNC()       st( P5SEL &= ~(BV(5) | BV(4)); P3SEL &= ~(BV(7));)
#define CC2520_ENABLE_SPI_FUNC()        st( P5SEL |= BV(5) | BV(4); P3SEL |= BV(7);)

// SPI register definitions
#define CC2520_SPI_TX_REG               UCB1_SPI_TX_REG//(UCB1TXBUF)
#define CC2520_SPI_RX_REG               UCB1_SPI_RX_REG //(UCB1RXBUF)
#define CC2520_SPI_RX_IS_READY()        UCB1_SPI_RX_IS_READY()//(UCB1IFG & UCRXIFG)
#define CC2520_SPI_RX_NOT_READY()       UCB1_SPI_RX_NOT_READY()//(UCB1IFG &= ~UCRXIFG)

// SPI access macros
#define CC2520_SPI_BEGIN()              P4OUT &= ~BIT1          //st( MCU_IO_SET(5,5,0); )
#define CC2520_SPI_TX(x)                st( CC2520_SPI_RX_NOT_READY(); CC2520_SPI_TX_REG = x; )
#define CC2520_SPI_RX()                 (CC2520_SPI_RX_REG)
#define CC2520_SPI_WAIT_RXRDY()         st( while (!CC2520_SPI_RX_IS_READY()); )
#define CC2520_SPI_END()                P4OUT |= BIT1           //st( MCU_IO_SET(5,5,1); )

// Outputs: SPI interface

#define CC2520_CSN_OPIN(v)              if(v) P4OUT |= BIT1;else P4OUT &= ~BIT1;//MCU_IO_SET(5,5,v)
#define CC2520_SCLK_OPIN(v)             if(v) P5OUT |= BIT5;else P5OUT &= ~BIT5;//MCU_IO_SET(3,6,v)
#define CC2520_MOSI_OPIN(v)             if(v) P3OUT |= BIT7;else P3OUT &= ~BIT7;//MCU_IO_SET(5,6,v)


// Inputs: SPI interface
#define CC2520_MISO_IPIN                (P5IN & BIT4)
         // For use in LPM - MCU_IO_SET(5,7,v)
#define CC2520_MISO_OPIN(v)             if(v) P5OUT |= BIT4;else P5OUT &= ~BIT4;
#define CC2520_MISO_DIR_IN()            P5DIR |= BIT4;                                          // MCU_PIN_DIR_OUT(5,7)
#define CC2520_MISO_DIR_OUT()           P5DIR &= ~BIT4;


#define RF_WAIT_TRANSCEIVER_READY()  st( WAIT_SFD_LOW();)
#define WAIT_RSSI_VALID()         st( while (!CC2520_RSSI_VALID_PIN);)
#define WAIT_SFD_HIGH()           st( while (!CC2520_SFD_PIN);)
#define WAIT_SFD_LOW()            st( while (CC2520_SFD_PIN);)
#define CLEAR_EXC_RX_FRM_DONE()   st(CC2520_CLEAR_EXC(CC2520_EXC_RX_FRM_DONE);)
#define CLEAR_EXC_RX_FRM_ACCEPTED()   st(CC2520_CLEAR_EXC(CC2520_EXC_RX_FRM_ACCEPTED);)

#define DPU_ACTIVE_H_BM           0x08
#define WAIT_DPU_DONE_H()         st( while (CC2520_INS_STROBE(CC2520_INS_SNOP) \
    & DPU_ACTIVE_H_BM);)

// GPIO pin direction control
/****************************************************************
 * CC2520 output means MSP430 input function (PxDIR &= ~BITx)
 */
#define CC2520_GPIO_DIR_OUT(pin) \
    st( \
        if (pin == 0) P1DIR &= ~BIT3; \
            if (pin == 1) P1DIR &= ~BIT5; \
                if (pin == 2) P1DIR &= ~BIT6; \
                    if (pin == 3) P1DIR &= ~BIT1; \
                        if (pin == 4) P1DIR &= ~BIT2; \
                            if (pin == 5) P1DIR &= ~BIT7; \
                                )


// GPIO pin direction control
/****************************************************************
 * close GPIO ports to reduce power consumptio (i.e. set port to 0 and then to input PxOUT = 0; PxDIR = 1;
 */
#define CC2520_GPIO_CLOSE(pin) \
    st( \
        if (pin == 0) P1DIR |= BIT3; P1OUT &= ~BIT3; \
            if (pin == 1) P1DIR |= BIT5; P1OUT &= ~BIT5; \
                if (pin == 2) P1DIR |= BIT6; P1OUT &= ~BIT6;  \
                    if (pin == 3) P1DIR |= BIT1; P1OUT &= ~BIT1;  \
                        if (pin == 4) P1DIR |= BIT2; P1OUT &= ~BIT2;  \
                            if (pin == 5) P1DIR |= BIT7; P1OUT &= ~BIT7;  \
                                )
// Configure a GPIO pin 'n' as output bound to the function 'fn'

 #define CC2520_CFG_GPIO_OUT(n, fn) \
    st( \
        CC2520_REGWR8(CC2520_GPIOCTRL0 + (n), (fn)); \
            CC2520_GPIO_DIR_OUT(n); \
                )

// Read exception map
#define CC2520_GET_EXC(dwMap) \
    CC2520_REGRD(CC2520_EXCFLAG0, 4, (u8_t  *)&(dwMap))

// Read FSM state value
#define CC2520_GET_FSM_STATE() \
    (CC2520_REGRD8(CC2520_FSMSTAT0) & CC2520_FSMSTAT_FSM_STATE_BV)

// Clear exception 'n'
#define CC2520_CLEAR_EXC(n) \
    CC2520_BCLR(CC2520_MAKE_BIT_ADDR(CC2520_EXCFLAG0 + ((n >> 3)&0x3), (n) & 0x07))

// Set exception mask A or B
#define CC2520_SET_EXCMASK(m, value) (CC2520_REGWR24(CC2520_EXCMASK##m##0, value))

// Make a BIT address from register address and bit number.
#define CC2520_MAKE_BIT_ADDR(regAddr, bitIndex) (((regAddr) << 3) | (bitIndex))

/***********************************************************************************
* CONSTANTS AND DEFINES
*/

// TXPOWER values
#define CC2520_TXPOWER_MIN_4_DBM        0x88  // Gives ~ -3.1 dBm TX output power
#define CC2520_TXPOWER_0_DBM            0x32  // Gives ~ 0.3 dBm TX output power
#define CC2520_TXPOWER_4_DBM            0xF7  // Gives ~ 4.6 dBm TX output power

#define CC2520_RSSI_OFFSET                76  // dBm (from data sheet)



// CC2520 pin assignments VERIFICARE
#define CC2520_RX_FRM_DONE_PIN              (P1IN & BIT3)//GPIO0 1.3
#define CC2520_SAMPLED_CCA_PIN              (P1IN & BIT5)//GPIO1 1.5
#define CC2520_RSSI_VALID_PIN               (P1IN & BIT2) //GPIO4 1.2
#define CC2520_TX_FRM_DONE_PIN              (P1IN & BIT6) //GPIO2 1.6
#define CC2520_SFD_PIN                      (P1IN & BIT1) //GPIO3 1.1
//#define CC2520_GPIO_SNIFFER_DATA_PIN        (P1IN & BIT2) //GPIO4 1.2
//#define CC2520_GPIO_SNIFFER_CLK_PIN         (P1IN & BIT7) //GPIO5 1.7
#define CC2520_GPIO_FIFOP_PIN         		(P1IN & BIT7) //GPIO5 1.7
#define CC2520_CCA_PIN          		    (P1IN & BIT5)//GPIO1 1.5


#define CC2520_MEMORY_SIZE                  0x400

// Startup time values (in microseconds)
#define CC2520_XOSC_MAX_STARTUP_TIME        500
#define CC2520_VREG_MAX_STARTUP_TIME        400
#define CC2520_SRXON_TO_RANDOM_READY_TIME   144

// Address definitions

// FREG definitions (BSET/BCLR supported)
#define CC2520_FRMFILT0                0x000
#define CC2520_FRMFILT1                0x001
#define CC2520_SRCMATCH                0x002
#define CC2520_SRCSHORTEN0             0x004
#define CC2520_SRCSHORTEN1             0x005
#define CC2520_SRCSHORTEN2             0x006
#define CC2520_SRCEXTEN0               0x008
#define CC2520_SRCEXTEN1               0x009
#define CC2520_SRCEXTEN2               0x00A
#define CC2520_FRMCTRL0                0x00C
#define CC2520_FRMCTRL1                0x00D
#define CC2520_RXENABLE0               0x00E
#define CC2520_RXENABLE1               0x00F
#define CC2520_EXCFLAG0                0x010
#define CC2520_EXCFLAG1                0x011
#define CC2520_EXCFLAG2                0x012
#define CC2520_EXCMASKA0               0x014
#define CC2520_EXCMASKA1               0x015
#define CC2520_EXCMASKA2               0x016
#define CC2520_EXCMASKB0               0x018
#define CC2520_EXCMASKB1               0x019
#define CC2520_EXCMASKB2               0x01A
#define CC2520_EXCBINDX0               0x01C
#define CC2520_EXCBINDX1               0x01D
#define CC2520_EXCBINDY0               0x01E
#define CC2520_EXCBINDY1               0x01F
#define CC2520_GPIOCTRL0               0x020
#define CC2520_GPIOCTRL1               0x021
#define CC2520_GPIOCTRL2               0x022
#define CC2520_GPIOCTRL3               0x023
#define CC2520_GPIOCTRL4               0x024
#define CC2520_GPIOCTRL5               0x025
#define CC2520_GPIOPOLARITY            0x026
#define CC2520_GPIOCTRL                0x028
#define CC2520_DPUCON                  0x02A
#define CC2520_DPUSTAT                 0x02C
#define CC2520_FREQCTRL                0x02E
#define CC2520_FREQTUNE                0x02F
#define CC2520_TXPOWER                 0x030
#define CC2520_TXCTRL                  0x031
#define CC2520_FSMSTAT0                0x032
#define CC2520_FSMSTAT1                0x033
#define CC2520_FIFOPCTRL               0x034
#define CC2520_FSMCTRL                 0x035
#define CC2520_CCACTRL0                0x036
#define CC2520_CCACTRL1                0x037
#define CC2520_RSSI                    0x038
#define CC2520_RSSISTAT                0x039
#define CC2520_TXFIFO_BUF              0x03A
#define CC2520_RXFIRST                 0x03C
#define CC2520_RXFIFOCNT               0x03E
#define CC2520_TXFIFOCNT               0x03F

// SREG definitions (BSET/BCLR unsupported)
#define CC2520_CHIPID                  0x040
#define CC2520_VERSION                 0x042
#define CC2520_EXTCLOCK                0x044
#define CC2520_MDMCTRL0                0x046
#define CC2520_MDMCTRL1                0x047
#define CC2520_FREQEST                 0x048
#define CC2520_RXCTRL                  0x04A
#define CC2520_FSCTRL                  0x04C
#define CC2520_FSCAL0                  0x04E
#define CC2520_FSCAL1                  0x04F
#define CC2520_FSCAL2                  0x050
#define CC2520_FSCAL3                  0x051
#define CC2520_AGCCTRL0                0x052
#define CC2520_AGCCTRL1                0x053
#define CC2520_AGCCTRL2                0x054
#define CC2520_AGCCTRL3                0x055
#define CC2520_ADCTEST0                0x056
#define CC2520_ADCTEST1                0x057
#define CC2520_ADCTEST2                0x058
#define CC2520_MDMTEST0                0x05A
#define CC2520_MDMTEST1                0x05B
#define CC2520_DACTEST0                0x05C
#define CC2520_DACTEST1                0x05D
#define CC2520_ATEST                   0x05E
#define CC2520_DACTEST2                0x05F
#define CC2520_PTEST0                  0x060
#define CC2520_PTEST1                  0x061
#define CC2520_RESERVED                0x062
#define CC2520_DPUBIST                 0x07A
#define CC2520_ACTBIST                 0x07C
#define CC2520_RAMBIST                 0x07E

// RAM size definitions
#define CC2520_RAM_START_ADDR          0x100
#define CC2520_RAM_SIZE                640

// RX and TX buffer definitions
#define CC2520_RAM_TXBUF               0x100
#define CC2520_RAM_RXBUF               0x180

